# Pandas 연습장
데이터 분석을 위한 기본적인 Pandas 예제를 알아봅시다!

## 1. Pandas 사용하기
소스코드 최상단에 아래와 같이 입력합니다. 보통 pd를 약자로 사용합니다.

In [2]:
import pandas as pd
import numpy as np

## 2. 파일 불러오기 / 저장하기
- pandas는 csv, excel, html, sql 소스에서 데이터를 읽어오는 함수를 제공
- 불러온 데이터는 pandasdml dataframe 객체 형식으로 자동 저장

1. CSV : pd.read_csv()  /  pd.to_csv()
2. EXCEL : pd.read_excel()  /  pd.to_csv()
3. HTML : pd.read_html()  /  pd.to_html()
4. SQL : pd.read_sql()  /  pd.to_sql()

### CSV
현재 경로 아래를 나타내는 것이 ./

In [4]:
df = pd.read_csv('./example_1.csv')

In [5]:
df

    a   b   c   d  e
0   1   2   3   4  1
1   5   6   7   8  0
2   9  10  11  12  1
3  13  14  15  16  0

In [6]:
df.to_csv('example_1_False.csv', index=False)
df.to_csv('example_1_True.csv', index=True)

index=False를 해주어야 인덱스가 삽입되지 않고 형태 그대로 csv를 저장할 수 있음.

### Excel

In [9]:
df2 = pd.read_excel('example_2.xlsx')

In [10]:
df2

    a   b   c   d  e
0   1   2   3   4  1
1   5   6   7   8  0
2   9  10  11  12  1
3  13  14  15  16  0

In [11]:
df2.to_excel('example_2_False.xlsx', index=False)

### HTML

In [13]:
df3 = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')
df3[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [14]:
df3

[                         Bank NameBank           CityCity StateSt  CertCert  \
 0                    Almena State Bank             Almena      KS     15426
 1           First City Bank of Florida  Fort Walton Beach      FL     16748
 2                 The First State Bank      Barboursville      WV     14361
 3                   Ericson State Bank            Ericson      NE     18265
 4     City National Bank of New Jersey             Newark      NJ     21111
 ..                                 ...                ...     ...       ...
 558                 Superior Bank, FSB           Hinsdale      IL     32646
 559                Malta National Bank              Malta      OH      6629
 560    First Alliance Bank & Trust Co.         Manchester      NH     34264
 561  National State Bank of Metropolis         Metropolis      IL      3815
 562                   Bank of Honolulu           Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0                            Equity Bank    October 23, 2020     10538
 1              United Fidelity Bank, fsb    October 16, 2020     10537
 2                         MVB Bank, Inc.       April 3, 2020     10536
 3             Farmers and Merchants Bank   February 14, 2020     10535
 4                        Industrial Bank    November 1, 2019     10534
 ..                                   ...                 ...       ...
 558                Superior Federal, FSB       July 27, 2001      6004
 559                    North Valley Bank         May 3, 2001      4648
 560  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 561              Banterra Bank of Marion   December 14, 2000      4646
 562                   Bank of the Orient    October 13, 2000      4645

 [563 rows x 7 columns]]

In [16]:
df3[0]['Bank NameBank']

0                      Almena State Bank
1             First City Bank of Florida
2                   The First State Bank
3                     Ericson State Bank
4       City National Bank of New Jersey
                     ...
558                   Superior Bank, FSB
559                  Malta National Bank
560      First Alliance Bank & Trust Co.
561    National State Bank of Metropolis
562                     Bank of Honolulu
Name: Bank NameBank, Length: 563, dtype: object

## 3. Pandas 자료형

pandas의 대표적인 자료형에는 Series와 DataFrame이 있음  
각 자료형의 특성과 활용 예시를 살펴봅시다.

1. Series : Numpy 배열과 유사. 축(axis) 정보를 사용할 수 있다는 점에서 다름
2. DataFrame : 행과 열 이름이 있는 2차원 자료형

In [17]:
list_var = ['a', 'b', 'c', 'd']
list_var

['a', 'b', 'c', 'd']

In [18]:
type(list_var)

list

In [19]:
series_var = pd.Series(list_var, index=[2,1,3,0])
series_var

2    a
1    b
3    c
0    d
dtype: object

In [20]:
type(series_var)

pandas.core.series.Series

### Series 생성
1. 리스트를 Series로 변환하거나
2. 사전(dictionary)을 Series로 변환할 수 있음

In [21]:
idx = ['a','b','c']
lst = [10, 20, 30]

In [22]:
pd.Series(data=lst)

0    10
1    20
2    30
dtype: int64

In [23]:
pd.Series(data=idx)

0    a
1    b
2    c
dtype: object

In [24]:
pd.Series(data=lst, index=idx)

a    10
b    20
c    30
dtype: int64

dictionary

In [26]:
dic = {'a':10, 'b':20, 'c':30}
ser = pd.Series(data=dic)
ser

a    10
b    20
c    30
dtype: int64

In [27]:
dic['a']

10

In [28]:
ser['a']

10

### 4. DataFrame
1. DataFrame = Series + Series + ... + Series
2. 거의 모든 데이터 처리에 DataFrame을 사용
3. 데이터프레임 정보보기 : head(), shape()
4. 특정요소에 접근하기
5. 데이터프레임 쪼개고 합치기
6. 누락 데이터 처리하기

#### 1) DataFrame 생성

In [29]:
df = pd.DataFrame(np.random.rand(5,5))
df

          0         1         2         3         4
0  0.111059  0.953011  0.342474  0.253269  0.669765
1  0.761659  0.631050  0.665890  0.805964  0.252872
2  0.123971  0.192464  0.453221  0.274705  0.558290
3  0.833077  0.455620  0.287691  0.560821  0.059895
4  0.528275  0.048329  0.165942  0.546158  0.126679

In [30]:
df = pd.DataFrame(np.random.rand(5,5), index=['A','B','C','D','E'], columns=['V','W','X','Y','Z'])
df

          V         W         X         Y         Z
A  0.284486  0.429564  0.565577  0.390065  0.817719
B  0.893834  0.811078  0.211535  0.327883  0.872908
C  0.241316  0.036413  0.582433  0.708707  0.634407
D  0.484424  0.614479  0.835420  0.445211  0.633328
E  0.555689  0.510504  0.083454  0.557784  0.290087

#### 2) 데이터프레임 살펴보기

In [31]:
df.shape

(5, 5)

In [32]:
df.columns

Index(['V', 'W', 'X', 'Y', 'Z'], dtype='object')

In [33]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [34]:
df.head()

          V         W         X         Y         Z
A  0.284486  0.429564  0.565577  0.390065  0.817719
B  0.893834  0.811078  0.211535  0.327883  0.872908
C  0.241316  0.036413  0.582433  0.708707  0.634407
D  0.484424  0.614479  0.835420  0.445211  0.633328
E  0.555689  0.510504  0.083454  0.557784  0.290087

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   V       5 non-null      float64
 1   W       5 non-null      float64
 2   X       5 non-null      float64
 3   Y       5 non-null      float64
 4   Z       5 non-null      float64
dtypes: float64(5)
memory usage: 240.0+ bytes

In [36]:
df.describe()

              V         W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000  5.000000
mean   0.491950  0.480407  0.455684  0.485930  0.649690
std    0.260523  0.286330  0.304345  0.150515  0.227967
min    0.241316  0.036413  0.083454  0.327883  0.290087
25%    0.284486  0.429564  0.211535  0.390065  0.633328
50%    0.484424  0.510504  0.565577  0.445211  0.634407
75%    0.555689  0.614479  0.582433  0.557784  0.817719
max    0.893834  0.811078  0.835420  0.708707  0.872908

#### 3) DataFrame 접근
열 기준으로 접근하는 방식

In [37]:
df['V']

A    0.284486
B    0.893834
C    0.241316
D    0.484424
E    0.555689
Name: V, dtype: float64

In [40]:
 df[['V', 'W']]

          V         W
A  0.284486  0.429564
B  0.893834  0.811078
C  0.241316  0.036413
D  0.484424  0.614479
E  0.555689  0.510504

In [41]:
df > 0.2

      V      W      X     Y     Z
A  True   True   True  True  True
B  True   True   True  True  True
C  True  False   True  True  True
D  True   True   True  True  True
E  True   True  False  True  True

In [42]:
df[df > 0.2]

          V         W         X         Y         Z
A  0.284486  0.429564  0.565577  0.390065  0.817719
B  0.893834  0.811078  0.211535  0.327883  0.872908
C  0.241316       NaN  0.582433  0.708707  0.634407
D  0.484424  0.614479  0.835420  0.445211  0.633328
E  0.555689  0.510504       NaN  0.557784  0.290087

In [43]:
df['W']>0.2

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [44]:
df[df['W']>0.2]

          V         W         X         Y         Z
A  0.284486  0.429564  0.565577  0.390065  0.817719
B  0.893834  0.811078  0.211535  0.327883  0.872908
D  0.484424  0.614479  0.835420  0.445211  0.633328
E  0.555689  0.510504  0.083454  0.557784  0.290087

In [48]:
df[(df['W']>0.2) & (df['V'] > 0.2)]

          V         W         X         Y         Z
A  0.284486  0.429564  0.565577  0.390065  0.817719
B  0.893834  0.811078  0.211535  0.327883  0.872908
D  0.484424  0.614479  0.835420  0.445211  0.633328
E  0.555689  0.510504  0.083454  0.557784  0.290087

#### 4) DataFrame Row 접근
데이터프레임의 행에 접근하는 방식
1. loc : 라벨값 기반의 2차원 인덱싱
2. iloc : 순서를 나타내는 정수 기반의 2차원 인덱싱

In [3]:
df = pd.read_csv('example_1.csv')

In [4]:
df

    a   b   c   d  e
0   1   2   3   4  1
1   5   6   7   8  0
2   9  10  11  12  1
3  13  14  15  16  0

In [5]:
df.loc[0]   # 0번째 행

a    1
b    2
c    3
d    4
e    1
Name: 0, dtype: int64

In [6]:
df['a'] # 열 뽑아 오는것과 비교

0     1
1     5
2     9
3    13
Name: a, dtype: int64

In [11]:
df.loc[df['e'] > 0.1]

   a   b   c   d  e
0  1   2   3   4  1
2  9  10  11  12  1

In [12]:
df.iloc[0]

a    1
b    2
c    3
d    4
e    1
Name: 0, dtype: int64

#### 5) DataFrame 합치기
1. 새로운 col 또는 row 추가
2. col을 기준으로 데이터프레임 병합
3. row를 기준으로 데이터프레임 병합

In [13]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                  index = [0,1,2,3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                  index = [0,1,2,3])

In [15]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [16]:
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [17]:
pd.concat([df1, df2])   # 열 기준 (axis=0 인 셈, 가로축 기준)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [18]:
pd.concat([df1, df2], axis=1)   # 행 기준  (axis=1 -> 세로축 기준)

    A   B   C   D   A   B   C   D
0  A0  B0  C0  D0  A4  B4  C4  D4
1  A1  B1  C1  D1  A5  B5  C5  D5
2  A2  B2  C2  D2  A6  B6  C6  D6
3  A3  B3  C3  D3  A7  B7  C7  D7

In [19]:
df1['new'] = [1,2,3,4]
df1

    A   B   C   D  new
0  A0  B0  C0  D0    1
1  A1  B1  C1  D1    2
2  A2  B2  C2  D2    3
3  A3  B3  C3  D3    4

In [20]:
df1.drop('new', axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [21]:
df1

    A   B   C   D  new
0  A0  B0  C0  D0    1
1  A1  B1  C1  D1    2
2  A2  B2  C2  D2    3
3  A3  B3  C3  D3    4

In [22]:
df1.drop('new', axis=1, inplace=True)   # inplace=True는 기존 것을 삭제 후 대체

In [23]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3